ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/eic.h
/*
 * Component description for EIC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_EIC_COMPONENT_H_
#define _SAMD21_EIC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR EIC                                          */
/* ************************************************************************** */

/* -------- EIC_CTRL : (EIC Offset: 0x00) (R/W 8) Control -------- */
#define EIC_CTRL_RESETVALUE _UINT8_(0x00) /*  (EIC_CTRL) Control  Reset Value */

#define EIC_CTRL_SWRST_Pos _UINT8_(0) /* (EIC_CTRL) Software Reset Position */
#define EIC_CTRL_SWRST_Msk (_UINT8_(0x1) << EIC_CTRL_SWRST_Pos) /* (EIC_CTRL) Software Reset Mask */
#define EIC_CTRL_SWRST(value)                                                                                          \
        (EIC_CTRL_SWRST_Msk &                                                                                          \
         (_UINT8_(value) << EIC_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the EIC_CTRL register */
#define EIC_CTRL_ENABLE_Pos _UINT8_(1) /* (EIC_CTRL) Enable Position */
#define EIC_CTRL_ENABLE_Msk (_UINT8_(0x1) << EIC_CTRL_ENABLE_Pos) /* (EIC_CTRL) Enable Mask */
#define EIC_CTRL_ENABLE(value)                                                                                         \
        (EIC_CTRL_ENABLE_Msk &                                                                                         \
         (_UINT8_(value) << EIC_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the EIC_CTRL register */
#define EIC_CTRL_Msk _UINT8_(0x03) /* (EIC_CTRL) Register Mask  */


/* -------- EIC_STATUS : (EIC Offset: 0x01) ( R/ 8) Status -------- */
#define EIC_STATUS_RESETVALUE _UINT8_(0x00) /*  (EIC_STATUS) Status  Reset Value */

#define EIC_STATUS_SYNCBUSY_Pos _UINT8_(7) /* (EIC_STATUS) Synchronization Busy Position */
#define EIC_STATUS_SYNCBUSY_Msk (_UINT8_(0x1) << EIC_STATUS_SYNCBUSY_Pos) /* (EIC_STATUS) Synchronization Busy Mask */
#define EIC_STATUS_SYNCBUSY(value)                                                                                     \
        (EIC_STATUS_SYNCBUSY_Msk &                                                                                     \
         (_UINT8_(value) << EIC_STATUS_SYNCBUSY_Pos)) /* Assigment of value for SYNCBUSY in the EIC_STATUS register */
#define EIC_STATUS_Msk _UINT8_(0x80) /* (EIC_STATUS) Register Mask  */


/* -------- EIC_NMICTRL : (EIC Offset: 0x02) (R/W 8) Non-Maskable Interrupt Control -------- */
#define EIC_NMICTRL_RESETVALUE _UINT8_(0x00) /*  (EIC_NMICTRL) Non-Maskable Interrupt Control  Reset Value */

#define EIC_NMICTRL_NMISENSE_Pos _UINT8_(0) /* (EIC_NMICTRL) Non-Maskable Interrupt Sense Position */
#define EIC_NMICTRL_NMISENSE_Msk                                                                                       \
        (_UINT8_(0x7) << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) Non-Maskable Interrupt Sense Mask */
#define EIC_NMICTRL_NMISENSE(value)                                                                                    \
        (EIC_NMICTRL_NMISENSE_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << EIC_NMICTRL_NMISENSE_Pos)) /* Assigment of value for NMISENSE in the EIC_NMICTRL register */
#define EIC_NMICTRL_NMISENSE_NONE_Val _UINT8_(0x0) /* (EIC_NMICTRL) No detection  */
#define EIC_NMICTRL_NMISENSE_RISE_Val _UINT8_(0x1) /* (EIC_NMICTRL) Rising-edge detection  */
#define EIC_NMICTRL_NMISENSE_FALL_Val _UINT8_(0x2) /* (EIC_NMICTRL) Falling-edge detection  */
#define EIC_NMICTRL_NMISENSE_BOTH_Val _UINT8_(0x3) /* (EIC_NMICTRL) Both-edges detection  */
#define EIC_NMICTRL_NMISENSE_HIGH_Val _UINT8_(0x4) /* (EIC_NMICTRL) High-level detection  */
#define EIC_NMICTRL_NMISENSE_LOW_Val _UINT8_(0x5) /* (EIC_NMICTRL) Low-level detection  */
#define EIC_NMICTRL_NMISENSE_NONE                                                                                      \
        (EIC_NMICTRL_NMISENSE_NONE_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) No detection Position  */
#define EIC_NMICTRL_NMISENSE_RISE                                                                                      \
        (EIC_NMICTRL_NMISENSE_RISE_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) Rising-edge detection Position */
#define EIC_NMICTRL_NMISENSE_FALL                                                                                      \
        (EIC_NMICTRL_NMISENSE_FALL_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) Falling-edge detection Position   \
                                                                     */
#define EIC_NMICTRL_NMISENSE_BOTH                                                                                      \
        (EIC_NMICTRL_NMISENSE_BOTH_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) Both-edges detection Position  */
#define EIC_NMICTRL_NMISENSE_HIGH                                                                                      \
        (EIC_NMICTRL_NMISENSE_HIGH_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) High-level detection Position  */
#define EIC_NMICTRL_NMISENSE_LOW                                                                                       \
        (EIC_NMICTRL_NMISENSE_LOW_Val << EIC_NMICTRL_NMISENSE_Pos) /* (EIC_NMICTRL) Low-level detection Position  */
#define EIC_NMICTRL_NMIFILTEN_Pos _UINT8_(3) /* (EIC_NMICTRL) Non-Maskable Interrupt Filter Enable Position */
#define EIC_NMICTRL_NMIFILTEN_Msk                                                                                      \
        (_UINT8_(0x1) << EIC_NMICTRL_NMIFILTEN_Pos) /* (EIC_NMICTRL) Non-Maskable Interrupt Filter Enable Mask */
#define EIC_NMICTRL_NMIFILTEN(value)                                                                                   \
        (EIC_NMICTRL_NMIFILTEN_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << EIC_NMICTRL_NMIFILTEN_Pos)) /* Assigment of value for NMIFILTEN in the EIC_NMICTRL register */
#define EIC_NMICTRL_Msk _UINT8_(0x0F) /* (EIC_NMICTRL) Register Mask  */


/* -------- EIC_NMIFLAG : (EIC Offset: 0x03) (R/W 8) Non-Maskable Interrupt Flag Status and Clear -------- */
#define EIC_NMIFLAG_RESETVALUE                                                                                         \
        _UINT8_(0x00) /*  (EIC_NMIFLAG) Non-Maskable Interrupt Flag Status and Clear  Reset Value */

#define EIC_NMIFLAG_NMI_Pos _UINT8_(0) /* (EIC_NMIFLAG) Non-Maskable Interrupt Position */
#define EIC_NMIFLAG_NMI_Msk (_UINT8_(0x1) << EIC_NMIFLAG_NMI_Pos) /* (EIC_NMIFLAG) Non-Maskable Interrupt Mask */
#define EIC_NMIFLAG_NMI(value)                                                                                         \
        (EIC_NMIFLAG_NMI_Msk &                                                                                         \
         (_UINT8_(value) << EIC_NMIFLAG_NMI_Pos)) /* Assigment of value for NMI in the EIC_NMIFLAG register */
#define EIC_NMIFLAG_Msk _UINT8_(0x01) /* (EIC_NMIFLAG) Register Mask  */


/* -------- EIC_EVCTRL : (EIC Offset: 0x04) (R/W 32) Event Control -------- */
#define EIC_EVCTRL_RESETVALUE _UINT32_(0x00) /*  (EIC_EVCTRL) Event Control  Reset Value */

#define EIC_EVCTRL_EXTINTEO0_Pos _UINT32_(0) /* (EIC_EVCTRL) External Interrupt 0 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO0_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO0_Pos) /* (EIC_EVCTRL) External Interrupt 0 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO0(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO0_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO0_Pos)) /* Assigment of value for EXTINTEO0 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO1_Pos _UINT32_(1) /* (EIC_EVCTRL) External Interrupt 1 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO1_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO1_Pos) /* (EIC_EVCTRL) External Interrupt 1 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO1(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO1_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO1_Pos)) /* Assigment of value for EXTINTEO1 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO2_Pos _UINT32_(2) /* (EIC_EVCTRL) External Interrupt 2 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO2_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO2_Pos) /* (EIC_EVCTRL) External Interrupt 2 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO2(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO2_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO2_Pos)) /* Assigment of value for EXTINTEO2 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO3_Pos _UINT32_(3) /* (EIC_EVCTRL) External Interrupt 3 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO3_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO3_Pos) /* (EIC_EVCTRL) External Interrupt 3 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO3(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO3_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO3_Pos)) /* Assigment of value for EXTINTEO3 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO4_Pos _UINT32_(4) /* (EIC_EVCTRL) External Interrupt 4 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO4_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO4_Pos) /* (EIC_EVCTRL) External Interrupt 4 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO4(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO4_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO4_Pos)) /* Assigment of value for EXTINTEO4 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO5_Pos _UINT32_(5) /* (EIC_EVCTRL) External Interrupt 5 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO5_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO5_Pos) /* (EIC_EVCTRL) External Interrupt 5 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO5(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO5_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO5_Pos)) /* Assigment of value for EXTINTEO5 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO6_Pos _UINT32_(6) /* (EIC_EVCTRL) External Interrupt 6 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO6_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO6_Pos) /* (EIC_EVCTRL) External Interrupt 6 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO6(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO6_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO6_Pos)) /* Assigment of value for EXTINTEO6 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO7_Pos _UINT32_(7) /* (EIC_EVCTRL) External Interrupt 7 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO7_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO7_Pos) /* (EIC_EVCTRL) External Interrupt 7 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO7(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO7_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO7_Pos)) /* Assigment of value for EXTINTEO7 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO8_Pos _UINT32_(8) /* (EIC_EVCTRL) External Interrupt 8 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO8_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO8_Pos) /* (EIC_EVCTRL) External Interrupt 8 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO8(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO8_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO8_Pos)) /* Assigment of value for EXTINTEO8 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO9_Pos _UINT32_(9) /* (EIC_EVCTRL) External Interrupt 9 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO9_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO9_Pos) /* (EIC_EVCTRL) External Interrupt 9 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO9(value)                                                                                    \
        (EIC_EVCTRL_EXTINTEO9_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO9_Pos)) /* Assigment of value for EXTINTEO9 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO10_Pos _UINT32_(10) /* (EIC_EVCTRL) External Interrupt 10 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO10_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO10_Pos) /* (EIC_EVCTRL) External Interrupt 10 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO10(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO10_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO10_Pos)) /* Assigment of value for EXTINTEO10 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO11_Pos _UINT32_(11) /* (EIC_EVCTRL) External Interrupt 11 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO11_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO11_Pos) /* (EIC_EVCTRL) External Interrupt 11 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO11(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO11_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO11_Pos)) /* Assigment of value for EXTINTEO11 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO12_Pos _UINT32_(12) /* (EIC_EVCTRL) External Interrupt 12 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO12_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO12_Pos) /* (EIC_EVCTRL) External Interrupt 12 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO12(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO12_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO12_Pos)) /* Assigment of value for EXTINTEO12 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO13_Pos _UINT32_(13) /* (EIC_EVCTRL) External Interrupt 13 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO13_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO13_Pos) /* (EIC_EVCTRL) External Interrupt 13 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO13(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO13_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO13_Pos)) /* Assigment of value for EXTINTEO13 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO14_Pos _UINT32_(14) /* (EIC_EVCTRL) External Interrupt 14 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO14_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO14_Pos) /* (EIC_EVCTRL) External Interrupt 14 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO14(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO14_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO14_Pos)) /* Assigment of value for EXTINTEO14 in the EIC_EVCTRL register */
#define EIC_EVCTRL_EXTINTEO15_Pos _UINT32_(15) /* (EIC_EVCTRL) External Interrupt 15 Event Output Enable Position */
#define EIC_EVCTRL_EXTINTEO15_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_EVCTRL_EXTINTEO15_Pos) /* (EIC_EVCTRL) External Interrupt 15 Event Output Enable Mask */
#define EIC_EVCTRL_EXTINTEO15(value)                                                                                   \
        (EIC_EVCTRL_EXTINTEO15_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_EVCTRL_EXTINTEO15_Pos)) /* Assigment of value for EXTINTEO15 in the EIC_EVCTRL register */
#define EIC_EVCTRL_Msk _UINT32_(0x0000FFFF) /* (EIC_EVCTRL) Register Mask  */

#define EIC_EVCTRL_EXTINTEO_Pos _UINT32_(0) /* (EIC_EVCTRL Position) External Interrupt x5 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO_Msk (_UINT32_(0xFFFF) << EIC_EVCTRL_EXTINTEO_Pos) /* (EIC_EVCTRL Mask) EXTINTEO */
#define EIC_EVCTRL_EXTINTEO(value) (EIC_EVCTRL_EXTINTEO_Msk & (_UINT32_(value) << EIC_EVCTRL_EXTINTEO_Pos))

/* -------- EIC_INTENCLR : (EIC Offset: 0x08) (R/W 32) Interrupt Enable Clear -------- */
#define EIC_INTENCLR_RESETVALUE _UINT32_(0x00) /*  (EIC_INTENCLR) Interrupt Enable Clear  Reset Value */

