ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/eic.h
#define EIC_INTENSET_EXTINT0_Pos _UINT32_(0) /* (EIC_INTENSET) External Interrupt 0 Enable Position */
#define EIC_INTENSET_EXTINT0_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT0_Pos) /* (EIC_INTENSET) External Interrupt 0 Enable Mask */
#define EIC_INTENSET_EXTINT0(value)                                                                                    \
        (EIC_INTENSET_EXTINT0_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT1_Pos _UINT32_(1) /* (EIC_INTENSET) External Interrupt 1 Enable Position */
#define EIC_INTENSET_EXTINT1_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT1_Pos) /* (EIC_INTENSET) External Interrupt 1 Enable Mask */
#define EIC_INTENSET_EXTINT1(value)                                                                                    \
        (EIC_INTENSET_EXTINT1_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT2_Pos _UINT32_(2) /* (EIC_INTENSET) External Interrupt 2 Enable Position */
#define EIC_INTENSET_EXTINT2_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT2_Pos) /* (EIC_INTENSET) External Interrupt 2 Enable Mask */
#define EIC_INTENSET_EXTINT2(value)                                                                                    \
        (EIC_INTENSET_EXTINT2_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT3_Pos _UINT32_(3) /* (EIC_INTENSET) External Interrupt 3 Enable Position */
#define EIC_INTENSET_EXTINT3_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT3_Pos) /* (EIC_INTENSET) External Interrupt 3 Enable Mask */
#define EIC_INTENSET_EXTINT3(value)                                                                                    \
        (EIC_INTENSET_EXTINT3_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT4_Pos _UINT32_(4) /* (EIC_INTENSET) External Interrupt 4 Enable Position */
#define EIC_INTENSET_EXTINT4_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT4_Pos) /* (EIC_INTENSET) External Interrupt 4 Enable Mask */
#define EIC_INTENSET_EXTINT4(value)                                                                                    \
        (EIC_INTENSET_EXTINT4_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT4_Pos)) /* Assigment of value for EXTINT4 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT5_Pos _UINT32_(5) /* (EIC_INTENSET) External Interrupt 5 Enable Position */
#define EIC_INTENSET_EXTINT5_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT5_Pos) /* (EIC_INTENSET) External Interrupt 5 Enable Mask */
#define EIC_INTENSET_EXTINT5(value)                                                                                    \
        (EIC_INTENSET_EXTINT5_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT5_Pos)) /* Assigment of value for EXTINT5 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT6_Pos _UINT32_(6) /* (EIC_INTENSET) External Interrupt 6 Enable Position */
#define EIC_INTENSET_EXTINT6_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT6_Pos) /* (EIC_INTENSET) External Interrupt 6 Enable Mask */
#define EIC_INTENSET_EXTINT6(value)                                                                                    \
        (EIC_INTENSET_EXTINT6_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT6_Pos)) /* Assigment of value for EXTINT6 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT7_Pos _UINT32_(7) /* (EIC_INTENSET) External Interrupt 7 Enable Position */
#define EIC_INTENSET_EXTINT7_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT7_Pos) /* (EIC_INTENSET) External Interrupt 7 Enable Mask */
#define EIC_INTENSET_EXTINT7(value)                                                                                    \
        (EIC_INTENSET_EXTINT7_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT7_Pos)) /* Assigment of value for EXTINT7 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT8_Pos _UINT32_(8) /* (EIC_INTENSET) External Interrupt 8 Enable Position */
#define EIC_INTENSET_EXTINT8_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT8_Pos) /* (EIC_INTENSET) External Interrupt 8 Enable Mask */
#define EIC_INTENSET_EXTINT8(value)                                                                                    \
        (EIC_INTENSET_EXTINT8_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT8_Pos)) /* Assigment of value for EXTINT8 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT9_Pos _UINT32_(9) /* (EIC_INTENSET) External Interrupt 9 Enable Position */
#define EIC_INTENSET_EXTINT9_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT9_Pos) /* (EIC_INTENSET) External Interrupt 9 Enable Mask */
#define EIC_INTENSET_EXTINT9(value)                                                                                    \
        (EIC_INTENSET_EXTINT9_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT9_Pos)) /* Assigment of value for EXTINT9 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT10_Pos _UINT32_(10) /* (EIC_INTENSET) External Interrupt 10 Enable Position */
#define EIC_INTENSET_EXTINT10_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT10_Pos) /* (EIC_INTENSET) External Interrupt 10 Enable Mask */
#define EIC_INTENSET_EXTINT10(value)                                                                                   \
        (EIC_INTENSET_EXTINT10_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT10_Pos)) /* Assigment of value for EXTINT10 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT11_Pos _UINT32_(11) /* (EIC_INTENSET) External Interrupt 11 Enable Position */
#define EIC_INTENSET_EXTINT11_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT11_Pos) /* (EIC_INTENSET) External Interrupt 11 Enable Mask */
#define EIC_INTENSET_EXTINT11(value)                                                                                   \
        (EIC_INTENSET_EXTINT11_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT11_Pos)) /* Assigment of value for EXTINT11 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT12_Pos _UINT32_(12) /* (EIC_INTENSET) External Interrupt 12 Enable Position */
#define EIC_INTENSET_EXTINT12_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT12_Pos) /* (EIC_INTENSET) External Interrupt 12 Enable Mask */
#define EIC_INTENSET_EXTINT12(value)                                                                                   \
        (EIC_INTENSET_EXTINT12_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT12_Pos)) /* Assigment of value for EXTINT12 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT13_Pos _UINT32_(13) /* (EIC_INTENSET) External Interrupt 13 Enable Position */
#define EIC_INTENSET_EXTINT13_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT13_Pos) /* (EIC_INTENSET) External Interrupt 13 Enable Mask */
#define EIC_INTENSET_EXTINT13(value)                                                                                   \
        (EIC_INTENSET_EXTINT13_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT13_Pos)) /* Assigment of value for EXTINT13 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT14_Pos _UINT32_(14) /* (EIC_INTENSET) External Interrupt 14 Enable Position */
#define EIC_INTENSET_EXTINT14_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT14_Pos) /* (EIC_INTENSET) External Interrupt 14 Enable Mask */
#define EIC_INTENSET_EXTINT14(value)                                                                                   \
        (EIC_INTENSET_EXTINT14_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT14_Pos)) /* Assigment of value for EXTINT14 in the EIC_INTENSET register */
#define EIC_INTENSET_EXTINT15_Pos _UINT32_(15) /* (EIC_INTENSET) External Interrupt 15 Enable Position */
#define EIC_INTENSET_EXTINT15_Msk                                                                                      \
        (_UINT32_(0x1) << EIC_INTENSET_EXTINT15_Pos) /* (EIC_INTENSET) External Interrupt 15 Enable Mask */
#define EIC_INTENSET_EXTINT15(value)                                                                                   \
        (EIC_INTENSET_EXTINT15_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << EIC_INTENSET_EXTINT15_Pos)) /* Assigment of value for EXTINT15 in the EIC_INTENSET register */
#define EIC_INTENSET_Msk _UINT32_(0x0000FFFF) /* (EIC_INTENSET) Register Mask  */

#define EIC_INTENSET_EXTINT_Pos _UINT32_(0) /* (EIC_INTENSET Position) External Interrupt x5 Enable */
#define EIC_INTENSET_EXTINT_Msk (_UINT32_(0xFFFF) << EIC_INTENSET_EXTINT_Pos) /* (EIC_INTENSET Mask) EXTINT */
#define EIC_INTENSET_EXTINT(value) (EIC_INTENSET_EXTINT_Msk & (_UINT32_(value) << EIC_INTENSET_EXTINT_Pos))

/* -------- EIC_INTFLAG : (EIC Offset: 0x10) (R/W 32) Interrupt Flag Status and Clear -------- */
#define EIC_INTFLAG_RESETVALUE _UINT32_(0x00) /*  (EIC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

