ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/eic.h
#define EIC_INTFLAG_EXTINT0_Pos _UINT32_(0) /* (EIC_INTFLAG) External Interrupt 0 Position */
#define EIC_INTFLAG_EXTINT0_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT0_Pos) /* (EIC_INTFLAG) External Interrupt 0 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT0(value)                                                                                     \
        (EIC_INTFLAG_EXTINT0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT1_Pos _UINT32_(1) /* (EIC_INTFLAG) External Interrupt 1 Position */
#define EIC_INTFLAG_EXTINT1_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT1_Pos) /* (EIC_INTFLAG) External Interrupt 1 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT1(value)                                                                                     \
        (EIC_INTFLAG_EXTINT1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT2_Pos _UINT32_(2) /* (EIC_INTFLAG) External Interrupt 2 Position */
#define EIC_INTFLAG_EXTINT2_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT2_Pos) /* (EIC_INTFLAG) External Interrupt 2 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT2(value)                                                                                     \
        (EIC_INTFLAG_EXTINT2_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT3_Pos _UINT32_(3) /* (EIC_INTFLAG) External Interrupt 3 Position */
#define EIC_INTFLAG_EXTINT3_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT3_Pos) /* (EIC_INTFLAG) External Interrupt 3 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT3(value)                                                                                     \
        (EIC_INTFLAG_EXTINT3_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT4_Pos _UINT32_(4) /* (EIC_INTFLAG) External Interrupt 4 Position */
#define EIC_INTFLAG_EXTINT4_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT4_Pos) /* (EIC_INTFLAG) External Interrupt 4 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT4(value)                                                                                     \
        (EIC_INTFLAG_EXTINT4_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT4_Pos)) /* Assigment of value for EXTINT4 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT5_Pos _UINT32_(5) /* (EIC_INTFLAG) External Interrupt 5 Position */
#define EIC_INTFLAG_EXTINT5_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT5_Pos) /* (EIC_INTFLAG) External Interrupt 5 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT5(value)                                                                                     \
        (EIC_INTFLAG_EXTINT5_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT5_Pos)) /* Assigment of value for EXTINT5 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT6_Pos _UINT32_(6) /* (EIC_INTFLAG) External Interrupt 6 Position */
#define EIC_INTFLAG_EXTINT6_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT6_Pos) /* (EIC_INTFLAG) External Interrupt 6 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT6(value)                                                                                     \
        (EIC_INTFLAG_EXTINT6_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT6_Pos)) /* Assigment of value for EXTINT6 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT7_Pos _UINT32_(7) /* (EIC_INTFLAG) External Interrupt 7 Position */
#define EIC_INTFLAG_EXTINT7_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT7_Pos) /* (EIC_INTFLAG) External Interrupt 7 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT7(value)                                                                                     \
        (EIC_INTFLAG_EXTINT7_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT7_Pos)) /* Assigment of value for EXTINT7 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT8_Pos _UINT32_(8) /* (EIC_INTFLAG) External Interrupt 8 Position */
#define EIC_INTFLAG_EXTINT8_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT8_Pos) /* (EIC_INTFLAG) External Interrupt 8 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT8(value)                                                                                     \
        (EIC_INTFLAG_EXTINT8_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT8_Pos)) /* Assigment of value for EXTINT8 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT9_Pos _UINT32_(9) /* (EIC_INTFLAG) External Interrupt 9 Position */
#define EIC_INTFLAG_EXTINT9_Msk (_UINT32_(0x1) << EIC_INTFLAG_EXTINT9_Pos) /* (EIC_INTFLAG) External Interrupt 9 Mask  \
                                                                            */
#define EIC_INTFLAG_EXTINT9(value)                                                                                     \
        (EIC_INTFLAG_EXTINT9_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT9_Pos)) /* Assigment of value for EXTINT9 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT10_Pos _UINT32_(10) /* (EIC_INTFLAG) External Interrupt 10 Position */
#define EIC_INTFLAG_EXTINT10_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT10_Pos) /* (EIC_INTFLAG) External Interrupt 10 Mask */
#define EIC_INTFLAG_EXTINT10(value)                                                                                    \
        (EIC_INTFLAG_EXTINT10_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT10_Pos)) /* Assigment of value for EXTINT10 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT11_Pos _UINT32_(11) /* (EIC_INTFLAG) External Interrupt 11 Position */
#define EIC_INTFLAG_EXTINT11_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT11_Pos) /* (EIC_INTFLAG) External Interrupt 11 Mask */
#define EIC_INTFLAG_EXTINT11(value)                                                                                    \
        (EIC_INTFLAG_EXTINT11_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT11_Pos)) /* Assigment of value for EXTINT11 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT12_Pos _UINT32_(12) /* (EIC_INTFLAG) External Interrupt 12 Position */
#define EIC_INTFLAG_EXTINT12_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT12_Pos) /* (EIC_INTFLAG) External Interrupt 12 Mask */
#define EIC_INTFLAG_EXTINT12(value)                                                                                    \
        (EIC_INTFLAG_EXTINT12_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT12_Pos)) /* Assigment of value for EXTINT12 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT13_Pos _UINT32_(13) /* (EIC_INTFLAG) External Interrupt 13 Position */
#define EIC_INTFLAG_EXTINT13_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT13_Pos) /* (EIC_INTFLAG) External Interrupt 13 Mask */
#define EIC_INTFLAG_EXTINT13(value)                                                                                    \
        (EIC_INTFLAG_EXTINT13_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT13_Pos)) /* Assigment of value for EXTINT13 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT14_Pos _UINT32_(14) /* (EIC_INTFLAG) External Interrupt 14 Position */
#define EIC_INTFLAG_EXTINT14_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT14_Pos) /* (EIC_INTFLAG) External Interrupt 14 Mask */
#define EIC_INTFLAG_EXTINT14(value)                                                                                    \
        (EIC_INTFLAG_EXTINT14_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT14_Pos)) /* Assigment of value for EXTINT14 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT15_Pos _UINT32_(15) /* (EIC_INTFLAG) External Interrupt 15 Position */
#define EIC_INTFLAG_EXTINT15_Msk                                                                                       \
        (_UINT32_(0x1) << EIC_INTFLAG_EXTINT15_Pos) /* (EIC_INTFLAG) External Interrupt 15 Mask */
#define EIC_INTFLAG_EXTINT15(value)                                                                                    \
        (EIC_INTFLAG_EXTINT15_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << EIC_INTFLAG_EXTINT15_Pos)) /* Assigment of value for EXTINT15 in the EIC_INTFLAG register */
#define EIC_INTFLAG_Msk _UINT32_(0x0000FFFF) /* (EIC_INTFLAG) Register Mask  */

#define EIC_INTFLAG_EXTINT_Pos _UINT32_(0) /* (EIC_INTFLAG Position) External Interrupt x5 */
#define EIC_INTFLAG_EXTINT_Msk (_UINT32_(0xFFFF) << EIC_INTFLAG_EXTINT_Pos) /* (EIC_INTFLAG Mask) EXTINT */
#define EIC_INTFLAG_EXTINT(value) (EIC_INTFLAG_EXTINT_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT_Pos))

/* -------- EIC_WAKEUP : (EIC Offset: 0x14) (R/W 32) Wake-Up Enable -------- */
#define EIC_WAKEUP_RESETVALUE _UINT32_(0x00) /*  (EIC_WAKEUP) Wake-Up Enable  Reset Value */

