ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/eic.h
#define EIC_CONFIG_SENSE0_Pos _UINT32_(0) /* (EIC_CONFIG) Input Sense 0 Configuration Position */
#define EIC_CONFIG_SENSE0_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) Input Sense 0 Configuration Mask */
#define EIC_CONFIG_SENSE0(value)                                                                                       \
        (EIC_CONFIG_SENSE0_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE0_Pos)) /* Assigment of value for SENSE0 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE0_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE0_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising-edge detection  */
#define EIC_CONFIG_SENSE0_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling-edge detection  */
#define EIC_CONFIG_SENSE0_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both-edges detection  */
#define EIC_CONFIG_SENSE0_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High-level detection  */
#define EIC_CONFIG_SENSE0_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low-level detection  */
#define EIC_CONFIG_SENSE0_NONE                                                                                         \
        (EIC_CONFIG_SENSE0_NONE_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE0_RISE                                                                                         \
        (EIC_CONFIG_SENSE0_RISE_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) Rising-edge detection Position  */
#define EIC_CONFIG_SENSE0_FALL                                                                                         \
        (EIC_CONFIG_SENSE0_FALL_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) Falling-edge detection Position  */
#define EIC_CONFIG_SENSE0_BOTH                                                                                         \
        (EIC_CONFIG_SENSE0_BOTH_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) Both-edges detection Position  */
#define EIC_CONFIG_SENSE0_HIGH                                                                                         \
        (EIC_CONFIG_SENSE0_HIGH_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) High-level detection Position  */
#define EIC_CONFIG_SENSE0_LOW                                                                                          \
        (EIC_CONFIG_SENSE0_LOW_Val << EIC_CONFIG_SENSE0_Pos) /* (EIC_CONFIG) Low-level detection Position  */
#define EIC_CONFIG_FILTEN0_Pos _UINT32_(3) /* (EIC_CONFIG) Filter 0 Enable Position */
#define EIC_CONFIG_FILTEN0_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN0_Pos) /* (EIC_CONFIG) Filter 0 Enable Mask */
#define EIC_CONFIG_FILTEN0(value)                                                                                      \
        (EIC_CONFIG_FILTEN0_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN0_Pos)) /* Assigment of value for FILTEN0 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE1_Pos _UINT32_(4) /* (EIC_CONFIG) Input Sense 1 Configuration Position */
#define EIC_CONFIG_SENSE1_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) Input Sense 1 Configuration Mask */
#define EIC_CONFIG_SENSE1(value)                                                                                       \
        (EIC_CONFIG_SENSE1_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE1_Pos)) /* Assigment of value for SENSE1 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE1_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE1_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE1_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE1_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE1_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE1_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE1_NONE                                                                                         \
        (EIC_CONFIG_SENSE1_NONE_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE1_RISE                                                                                         \
        (EIC_CONFIG_SENSE1_RISE_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE1_FALL                                                                                         \
        (EIC_CONFIG_SENSE1_FALL_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE1_BOTH                                                                                         \
        (EIC_CONFIG_SENSE1_BOTH_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE1_HIGH                                                                                         \
        (EIC_CONFIG_SENSE1_HIGH_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE1_LOW                                                                                          \
        (EIC_CONFIG_SENSE1_LOW_Val << EIC_CONFIG_SENSE1_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN1_Pos _UINT32_(7) /* (EIC_CONFIG) Filter 1 Enable Position */
#define EIC_CONFIG_FILTEN1_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN1_Pos) /* (EIC_CONFIG) Filter 1 Enable Mask */
#define EIC_CONFIG_FILTEN1(value)                                                                                      \
        (EIC_CONFIG_FILTEN1_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN1_Pos)) /* Assigment of value for FILTEN1 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE2_Pos _UINT32_(8) /* (EIC_CONFIG) Input Sense 2 Configuration Position */
#define EIC_CONFIG_SENSE2_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) Input Sense 2 Configuration Mask */
#define EIC_CONFIG_SENSE2(value)                                                                                       \
        (EIC_CONFIG_SENSE2_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE2_Pos)) /* Assigment of value for SENSE2 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE2_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE2_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE2_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE2_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE2_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE2_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE2_NONE                                                                                         \
        (EIC_CONFIG_SENSE2_NONE_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE2_RISE                                                                                         \
        (EIC_CONFIG_SENSE2_RISE_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE2_FALL                                                                                         \
        (EIC_CONFIG_SENSE2_FALL_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE2_BOTH                                                                                         \
        (EIC_CONFIG_SENSE2_BOTH_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE2_HIGH                                                                                         \
        (EIC_CONFIG_SENSE2_HIGH_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE2_LOW                                                                                          \
        (EIC_CONFIG_SENSE2_LOW_Val << EIC_CONFIG_SENSE2_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN2_Pos _UINT32_(11) /* (EIC_CONFIG) Filter 2 Enable Position */
#define EIC_CONFIG_FILTEN2_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN2_Pos) /* (EIC_CONFIG) Filter 2 Enable Mask */
#define EIC_CONFIG_FILTEN2(value)                                                                                      \
        (EIC_CONFIG_FILTEN2_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN2_Pos)) /* Assigment of value for FILTEN2 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE3_Pos _UINT32_(12) /* (EIC_CONFIG) Input Sense 3 Configuration Position */
#define EIC_CONFIG_SENSE3_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) Input Sense 3 Configuration Mask */
#define EIC_CONFIG_SENSE3(value)                                                                                       \
        (EIC_CONFIG_SENSE3_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE3_Pos)) /* Assigment of value for SENSE3 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE3_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE3_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE3_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE3_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE3_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE3_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE3_NONE                                                                                         \
        (EIC_CONFIG_SENSE3_NONE_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE3_RISE                                                                                         \
        (EIC_CONFIG_SENSE3_RISE_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE3_FALL                                                                                         \
        (EIC_CONFIG_SENSE3_FALL_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE3_BOTH                                                                                         \
        (EIC_CONFIG_SENSE3_BOTH_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE3_HIGH                                                                                         \
        (EIC_CONFIG_SENSE3_HIGH_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE3_LOW                                                                                          \
        (EIC_CONFIG_SENSE3_LOW_Val << EIC_CONFIG_SENSE3_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN3_Pos _UINT32_(15) /* (EIC_CONFIG) Filter 3 Enable Position */
#define EIC_CONFIG_FILTEN3_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN3_Pos) /* (EIC_CONFIG) Filter 3 Enable Mask */
#define EIC_CONFIG_FILTEN3(value)                                                                                      \
        (EIC_CONFIG_FILTEN3_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN3_Pos)) /* Assigment of value for FILTEN3 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE4_Pos _UINT32_(16) /* (EIC_CONFIG) Input Sense 4 Configuration Position */
#define EIC_CONFIG_SENSE4_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) Input Sense 4 Configuration Mask */
#define EIC_CONFIG_SENSE4(value)                                                                                       \
        (EIC_CONFIG_SENSE4_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE4_Pos)) /* Assigment of value for SENSE4 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE4_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE4_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE4_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE4_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE4_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE4_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE4_NONE                                                                                         \
        (EIC_CONFIG_SENSE4_NONE_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE4_RISE                                                                                         \
        (EIC_CONFIG_SENSE4_RISE_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE4_FALL                                                                                         \
        (EIC_CONFIG_SENSE4_FALL_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE4_BOTH                                                                                         \
        (EIC_CONFIG_SENSE4_BOTH_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE4_HIGH                                                                                         \
        (EIC_CONFIG_SENSE4_HIGH_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE4_LOW                                                                                          \
        (EIC_CONFIG_SENSE4_LOW_Val << EIC_CONFIG_SENSE4_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN4_Pos _UINT32_(19) /* (EIC_CONFIG) Filter 4 Enable Position */
#define EIC_CONFIG_FILTEN4_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN4_Pos) /* (EIC_CONFIG) Filter 4 Enable Mask */
#define EIC_CONFIG_FILTEN4(value)                                                                                      \
        (EIC_CONFIG_FILTEN4_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN4_Pos)) /* Assigment of value for FILTEN4 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE5_Pos _UINT32_(20) /* (EIC_CONFIG) Input Sense 5 Configuration Position */
#define EIC_CONFIG_SENSE5_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) Input Sense 5 Configuration Mask */
#define EIC_CONFIG_SENSE5(value)                                                                                       \
        (EIC_CONFIG_SENSE5_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE5_Pos)) /* Assigment of value for SENSE5 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE5_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE5_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE5_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE5_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE5_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE5_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE5_NONE                                                                                         \
        (EIC_CONFIG_SENSE5_NONE_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE5_RISE                                                                                         \
        (EIC_CONFIG_SENSE5_RISE_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE5_FALL                                                                                         \
        (EIC_CONFIG_SENSE5_FALL_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE5_BOTH                                                                                         \
        (EIC_CONFIG_SENSE5_BOTH_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE5_HIGH                                                                                         \
        (EIC_CONFIG_SENSE5_HIGH_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE5_LOW                                                                                          \
        (EIC_CONFIG_SENSE5_LOW_Val << EIC_CONFIG_SENSE5_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN5_Pos _UINT32_(23) /* (EIC_CONFIG) Filter 5 Enable Position */
#define EIC_CONFIG_FILTEN5_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN5_Pos) /* (EIC_CONFIG) Filter 5 Enable Mask */
#define EIC_CONFIG_FILTEN5(value)                                                                                      \
        (EIC_CONFIG_FILTEN5_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN5_Pos)) /* Assigment of value for FILTEN5 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE6_Pos _UINT32_(24) /* (EIC_CONFIG) Input Sense 6 Configuration Position */
#define EIC_CONFIG_SENSE6_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) Input Sense 6 Configuration Mask */
#define EIC_CONFIG_SENSE6(value)                                                                                       \
        (EIC_CONFIG_SENSE6_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE6_Pos)) /* Assigment of value for SENSE6 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE6_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE6_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE6_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE6_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE6_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE6_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE6_NONE                                                                                         \
        (EIC_CONFIG_SENSE6_NONE_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE6_RISE                                                                                         \
        (EIC_CONFIG_SENSE6_RISE_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE6_FALL                                                                                         \
        (EIC_CONFIG_SENSE6_FALL_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE6_BOTH                                                                                         \
        (EIC_CONFIG_SENSE6_BOTH_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE6_HIGH                                                                                         \
        (EIC_CONFIG_SENSE6_HIGH_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE6_LOW                                                                                          \
        (EIC_CONFIG_SENSE6_LOW_Val << EIC_CONFIG_SENSE6_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN6_Pos _UINT32_(27) /* (EIC_CONFIG) Filter 6 Enable Position */
#define EIC_CONFIG_FILTEN6_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN6_Pos) /* (EIC_CONFIG) Filter 6 Enable Mask */
#define EIC_CONFIG_FILTEN6(value)                                                                                      \
        (EIC_CONFIG_FILTEN6_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN6_Pos)) /* Assigment of value for FILTEN6 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE7_Pos _UINT32_(28) /* (EIC_CONFIG) Input Sense 7 Configuration Position */
#define EIC_CONFIG_SENSE7_Msk                                                                                          \
        (_UINT32_(0x7) << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) Input Sense 7 Configuration Mask */
#define EIC_CONFIG_SENSE7(value)                                                                                       \
        (EIC_CONFIG_SENSE7_Msk &                                                                                       \
         (_UINT32_(value) << EIC_CONFIG_SENSE7_Pos)) /* Assigment of value for SENSE7 in the EIC_CONFIG register */
#define EIC_CONFIG_SENSE7_NONE_Val _UINT32_(0x0) /* (EIC_CONFIG) No detection  */
#define EIC_CONFIG_SENSE7_RISE_Val _UINT32_(0x1) /* (EIC_CONFIG) Rising edge detection  */
#define EIC_CONFIG_SENSE7_FALL_Val _UINT32_(0x2) /* (EIC_CONFIG) Falling edge detection  */
#define EIC_CONFIG_SENSE7_BOTH_Val _UINT32_(0x3) /* (EIC_CONFIG) Both edges detection  */
#define EIC_CONFIG_SENSE7_HIGH_Val _UINT32_(0x4) /* (EIC_CONFIG) High level detection  */
#define EIC_CONFIG_SENSE7_LOW_Val _UINT32_(0x5) /* (EIC_CONFIG) Low level detection  */
#define EIC_CONFIG_SENSE7_NONE                                                                                         \
        (EIC_CONFIG_SENSE7_NONE_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) No detection Position  */
#define EIC_CONFIG_SENSE7_RISE                                                                                         \
        (EIC_CONFIG_SENSE7_RISE_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) Rising edge detection Position  */
#define EIC_CONFIG_SENSE7_FALL                                                                                         \
