ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/eic.h
        (EIC_CONFIG_SENSE7_FALL_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) Falling edge detection Position  */
#define EIC_CONFIG_SENSE7_BOTH                                                                                         \
        (EIC_CONFIG_SENSE7_BOTH_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) Both edges detection Position  */
#define EIC_CONFIG_SENSE7_HIGH                                                                                         \
        (EIC_CONFIG_SENSE7_HIGH_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) High level detection Position  */
#define EIC_CONFIG_SENSE7_LOW                                                                                          \
        (EIC_CONFIG_SENSE7_LOW_Val << EIC_CONFIG_SENSE7_Pos) /* (EIC_CONFIG) Low level detection Position  */
#define EIC_CONFIG_FILTEN7_Pos _UINT32_(31) /* (EIC_CONFIG) Filter 7 Enable Position */
#define EIC_CONFIG_FILTEN7_Msk (_UINT32_(0x1) << EIC_CONFIG_FILTEN7_Pos) /* (EIC_CONFIG) Filter 7 Enable Mask */
#define EIC_CONFIG_FILTEN7(value)                                                                                      \
        (EIC_CONFIG_FILTEN7_Msk &                                                                                      \
         (_UINT32_(value) << EIC_CONFIG_FILTEN7_Pos)) /* Assigment of value for FILTEN7 in the EIC_CONFIG register */
#define EIC_CONFIG_Msk _UINT32_(0xFFFFFFFF) /* (EIC_CONFIG) Register Mask  */


/** \brief EIC register offsets definitions */
#define EIC_CTRL_REG_OFST _UINT32_(0x00) /* (EIC_CTRL) Control Offset */
#define EIC_STATUS_REG_OFST _UINT32_(0x01) /* (EIC_STATUS) Status Offset */
#define EIC_NMICTRL_REG_OFST _UINT32_(0x02) /* (EIC_NMICTRL) Non-Maskable Interrupt Control Offset */
#define EIC_NMIFLAG_REG_OFST _UINT32_(0x03) /* (EIC_NMIFLAG) Non-Maskable Interrupt Flag Status and Clear Offset */
#define EIC_EVCTRL_REG_OFST _UINT32_(0x04) /* (EIC_EVCTRL) Event Control Offset */
#define EIC_INTENCLR_REG_OFST _UINT32_(0x08) /* (EIC_INTENCLR) Interrupt Enable Clear Offset */
#define EIC_INTENSET_REG_OFST _UINT32_(0x0C) /* (EIC_INTENSET) Interrupt Enable Set Offset */
#define EIC_INTFLAG_REG_OFST _UINT32_(0x10) /* (EIC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define EIC_WAKEUP_REG_OFST _UINT32_(0x14) /* (EIC_WAKEUP) Wake-Up Enable Offset */
#define EIC_CONFIG_REG_OFST _UINT32_(0x18) /* (EIC_CONFIG) Configuration n Offset */
#define EIC_CONFIG0_REG_OFST _UINT32_(0x18) /* (EIC_CONFIG0) Configuration n Offset */
#define EIC_CONFIG1_REG_OFST _UINT32_(0x1C) /* (EIC_CONFIG1) Configuration n Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief EIC register API structure */
typedef struct { /* External Interrupt Controller */
        __IO uint8_t EIC_CTRL; /**< Offset: 0x00 (R/W  8) Control */
        __I uint8_t EIC_STATUS; /**< Offset: 0x01 (R/   8) Status */
        __IO uint8_t EIC_NMICTRL; /**< Offset: 0x02 (R/W  8) Non-Maskable Interrupt Control */
        __IO uint8_t EIC_NMIFLAG; /**< Offset: 0x03 (R/W  8) Non-Maskable Interrupt Flag Status and Clear */
        __IO uint32_t EIC_EVCTRL; /**< Offset: 0x04 (R/W  32) Event Control */
        __IO uint32_t EIC_INTENCLR; /**< Offset: 0x08 (R/W  32) Interrupt Enable Clear */
        __IO uint32_t EIC_INTENSET; /**< Offset: 0x0C (R/W  32) Interrupt Enable Set */
        __IO uint32_t EIC_INTFLAG; /**< Offset: 0x10 (R/W  32) Interrupt Flag Status and Clear */
        __IO uint32_t EIC_WAKEUP; /**< Offset: 0x14 (R/W  32) Wake-Up Enable */
        __IO uint32_t EIC_CONFIG[2]; /**< Offset: 0x18 (R/W  32) Configuration n */
} eic_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_EIC_COMPONENT_H_ */
